<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"><HTML>
<HEAD>
<TITLE></TITLE>
</HEAD>
<BODY>
<A name=1></a> <br>

<h1>ALLGEMEINE GESCH&Auml;FTSBEDINGUNGENBEDINGUNGEN </h1>
<b>f&uuml;r den Verkauf und die Lieferung von Organisations-, Programmierleistungen und Werknutzungsbewilligungen von Softwareprodukten </b><br>
<br>
 <br>
<b>Andreas Hocevar<br>Geospatial Solutions</b><br>
<b> </b><br>
Josefigasse 55/13<br>
8020 Graz<br>
&Ouml;sterreich<br>
<b> </b><br>
<hr>
<h2>1. Vertragsumfang und G&uuml;ltigkeit </h2>
<p>Alle Auftr&auml;ge und Vereinbarungen sind nur dann rechtsverbindlich, wenn sie vom
Auftragnehmer schriftlich und firmengem&auml;&szlig; gezeichnet werden und verpflichten nur in dem in der Auftragsbest&auml;tigung angegebenem Umfang. Einkaufsbedingungen des Auftraggebers werden f&uuml;r das gegenst&auml;ndliche Rechtsgesch&auml;ft und die gesamte Gesch&auml;ftsbeziehung hiermit ausgeschlossen. Angebote sind grunds&auml;tzlich freibleibend.</p>
<h2>2. Leistung und Pr&uuml;fung </h2>
<h3>2.1.</h3>
<p>Gegenstand eines Auftrages kann sein:</p>
<ul>
<li>Ausarbeitung von Organisationskonzepten</li> 
<li>Global- und Detailanalysen</li>
<li>Erstellung von Individualprogrammen</li>
<li>Lieferung von Bibliotheks- (Standard-)Programmen</li>
<li>Erwerb von Nutzungsberechtigungen f&uuml;r Softwareprodukte</li>
<li>Erwerb von Werknutzungsbewilligungen</li>
<li>Mitwirkung bei der Inbetriebnahme (Umstellungsunterst&uuml;tzung)</li>
<li>Telefonische Beratung</li>
<li>Programmwartung</li>
<li>Erstellung von Programmtr&auml;gern</li>
<li>Sonstige Dienstleistungen</li>
</ul>
<h3>2.2.</h3>
<p>Die Ausarbeitung individueller Organisationskonzepte und Programme erfolgt nach 
Art und Umfang der vom Auftraggeber vollst&auml;ndig zur Verf&uuml;gung gestellten bindenden Informationen, Unterlagen und Hilfsmittel. Dazu z&auml;hlen auch praxisgerechte Testdaten sowie Testm&ouml;glichkeiten in ausreichendem Ausma&szlig; die der Auftraggeber zeitgerecht, in der Normalarbeitszeit und auf seine Kosten zur Verf&uuml;gung stellt. Wird vom Auftraggeber bereits auf der zum Test zur Verf&uuml;gung
gestellten Anlage im Echtbetrieb gearbeitet, liegt die Verantwortung f&uuml;r die Sicherung der Echtdaten beim Auftraggeber.</p>
<h3>2.3.</h3>
<p>Grundlage f&uuml;r die Erstellung von Individualprogrammen ist die schriftliche Leistungsbeschreibung, die der Auftragnehmer gegen Kostenberechnung aufgrund der ihm zur Verf&uuml;gung gestellten Unterlagen und Informationen ausarbeitet bzw. der Auftraggeber zur Verf&uuml;gung stellt. Diese Leistungsbeschreibung ist vom Auftraggeber auf Richtigkeit und Vollst&auml;ndigkeit zu &uuml;berpr&uuml;fen und mit seinem Zustimmungsvermerk zu versehen. Sp&auml;ter auftretende &Auml;nderungsw&uuml;nsche k&ouml;nnen zu 
gesonderten Termin- und Preisvereinbarungen f&uuml;hren.</p>
<h3>2.4.</h3>
<p>Individuell erstellte Software bzw. Programmadaptierungen bed&uuml;rfen f&uuml;r das
jeweils betroffene Programmpaket einer Programmabnahme sp&auml;testens vier Wochen ab Lieferung durch den Auftraggeber. Diese wird in einem Protokoll vom Auftraggeber best&auml;tigt. (Pr&uuml;fung auf Richtigkeit und Vollst&auml;ndigkeit anhand der vom Auftragnehmer akzeptierten Leistungsbeschreibung mittels der unter Punkt 2.2. angef&uuml;hrten zur Verf&uuml;gung gestellten Testdaten). L&auml;&szlig;t der Auftraggeber den Zeitraum von vier Wochen ohne Programmabnahme verstreichen, so gilt die 
gelieferte Software mit dem Enddatum des genannten Zeitraumes als abgenommen. Bei Einsatz der Software im Echtbetrieb durch den Auftraggeber gilt die Software jedenfalls als abgenommen. 
Etwa auftretende M&auml;ngel, das sind Abweichungen von der schriftlich vereinbarten Leistungsbeschreibung, sind vom Auftraggeber ausreichend dokumentiert dem 
Auftragnehmer zu melden, der um raschest m&ouml;gliche M&auml;ngelbehebung bem&uuml;ht ist. Liegen schriftlich gemeldete, wesentliche M&auml;ngel vor, das hei&szlig;t, dass der Echtbetrieb nicht begonnen oder fortgesetzt werden kann, so ist nach M&auml;ngelbehebung eine neuerliche Abnahme erforderlich. Der Auftraggeber ist nicht berechtigt, die Abnahme von Software wegen unwesentlicher M&auml;ngel abzulehnen.</p>
<h3>2.5.</h3>
<p>Bei Bestellung von Bibliotheks-(Standard-)Programmen best&auml;tigt der Auftraggeber 
mit der Bestellung die Kenntnis des Leistungsumfanges der bestellten Programme.</p> 
<h3>2.6.</h3>
<p>Sollte sich im Zuge der Arbeiten herausstellen, dass die Ausf&uuml;hrung des Auftrages 
gem&auml;&szlig; Leistungsbeschreibung tats&auml;chlich oder juristisch unm&ouml;glich ist, ist der Auftragnehmer verpflichtet, dies dem Auftraggeber sofort anzuzeigen. &Auml;ndert der Auftraggeber die Leistungsbeschreibung nicht dahingehend bzw. schafft die Voraussetzung, dass eine Ausf&uuml;hrung m&ouml;glich wird, kann der Auftragnehmer die Ausf&uuml;hrung ablehnen. Ist die Unm&ouml;glichkeit der Ausf&uuml;hrung die Folge eines Vers&auml;umnisses des Auftraggebers oder einer nachtr&auml;glichen &Auml;nderung der Leistungsbeschreibung durch den Auftraggeber, ist der Auftragnehmer berechtigt,
vom Auftrag zur&uuml;ckzutreten. Die bis dahin f&uuml;r die T&auml;tigkeit des Auftragnehmers angefallenen Kosten und Spesen sowie allf&auml;llige Abbaukosten sind vom Auftraggeber zu ersetzen.</p>
<h3>2.7.</h3>
<p>Ein Versand von Programmtr&auml;gern, Dokumentationen und Leistungsbeschreibungen
erfolgt auf Kosten und Gefahr des Auftraggebers. Dar&uuml;ber hinaus vom Auftraggeber gew&uuml;nschte Schulung und Erkl&auml;rungen werden gesondert in Rechnung gestellt. Versicherungen erfolgen nur auf Wunsch des Auftraggebers.</p>
<h2>3. Preise, Steuern und Geb&uuml;hren</h2>
<h3>3.1.</h3>
<p>Alle Preise verstehen sich in Euro ohne Umsatzsteuer. Sie gelten nur f&uuml;r den
vorliegenden Auftrag. Die genannten Preise verstehen sich ab Gesch&auml;ftssitz bzw. -stelle des Auftragnehmers. Die Kosten von Programmtr&auml;gern (z.B. CD’s, Magnetb&auml;nder, Magnetplatten, Floppy Disks, Streamer Tapes, Magnetbandkassetten usw.) sowie allf&auml;llige Vertragsgeb&uuml;hren werden gesondert in Rechnung gestellt.</p>
<h3>3.2.</h3>
<p>Bei Bibliotheks- (Standard)-Programmen gelten die am Tag der Lieferung g&uuml;ltigen
Listenpreise. Bei allen anderen Dienstleistungen (Organisationsberatung, Programmierung, Einschulung, Umstellungsunterst&uuml;tzung, telefonische Beratung
usw.) wird der Arbeitsaufwand zu den am Tag der Leistungserbringung g&uuml;ltigen S&auml;tzen verrechnet. Abweichungen von einem dem Vertragspreis zugrundeliegenden Zeitaufwand, der nicht vom Auftragnehmer zu vertreten ist, wird nach tats&auml;chlichem Anfall berechnet.</p>
<h3>3.3.</h3>
<p>Die Kosten f&uuml;r Fahrt-, Tag- und N&auml;chtigungsgelder werden dem Auftraggeber
gesondert nach den jeweils g&uuml;ltigen S&auml;tzen in Rechnung gestellt. Wegzeiten gelten als Arbeitszeit.</p>
<h2>4. Liefertermin</h2>
<h3>4.1.</h3>
<p>Der Auftragnehmer ist bestrebt, die vereinbarten Termine der Erf&uuml;llung
(Fertigstellung) m&ouml;glichst genau einzuhalten.</p>
<h3>4.2.</h3>
<p>Die angestrebten Erf&uuml;llungstermine k&ouml;nnen nur dann eingehalten werden, wenn der
Auftraggeber zu den vom Auftragnehmer angegebenen Terminen alle notwendigen Arbeiten und Unterlagen vollst&auml;ndig, insbesondere die von ihm akzeptierte 
Leistungsbeschreibung lt. Punkt 2.3. zur Verf&uuml;gung stellt und seiner Mitwirkungsverpflichtung im erforderlichen Ausma&szlig; nachkommt. Lieferverz&ouml;gerungen und Kostenerh&ouml;hungen, die durch unrichtige, unvollst&auml;ndige oder nachtr&auml;glich ge&auml;nderte Angaben und Informationen bzw. zur Verf&uuml;gung gestellte Unterlagen entstehen, sind vom Auftragnehmer nicht zu vertreten und k&ouml;nnen nicht zum Verzug des Auftragnehmers f&uuml;hren. Daraus resultierende Mehrkosten tr&auml;gt der Auftraggeber.</p>
<h3>4.3.</h3>
<p>Bei Auftr&auml;gen, die mehrere Einheiten bzw. Programme umfassen, ist der
Auftragnehmer berechtigt, Teillieferungen durchzuf&uuml;hren bzw. Teilrechnungen zu legen. 
<h2>5. Zahlung</h2>
<h3>5.1.</h3>
<p>Die vom Auftragnehmer gelegten Rechnungen inklusive Umsatzsteuer sind 
sp&auml;testens 14 Tage ab Fakturenerhalt ohne jeden Abzug und spesenfrei zahlbar. F&uuml;r Teilrechnungen gelten die f&uuml;r den Gesamtauftrag festgelegten Zahlungsbedingungen analog.</p>
<h3>5.2.</h3>
<p>Bei Auftr&auml;gen, die mehrere Einheiten (z.B. Programme und/oder Schulungen, Realisierungen in Teilschritten) umfassen, ist der Auftragnehmer berechtigt, nach Lieferung jeder einzelnen Einheit oder Leistung Rechnung zu legen.</p>
<h3>5.3.</h3>
<p>Die Einhaltung der vereinbarten Zahlungstermine bildet eine wesentliche Bedingung
f&uuml;r die Durchf&uuml;hrung der Lieferung bzw. Vertragserf&uuml;llung durch den Auftragnehmer. Die Nichteinhaltung der vereinbarten Zahlungen berechtigen den Auftragnehmer, die laufenden Arbeiten einzustellen und vom Vertrag zur&uuml;ckzutreten. Alle damit verbundenen Kosten sowie der Gewinnentgang sind vom Auftraggeber zu tragen. Bei Zahlungsverzug werden Verzugszinsen im bank&uuml;blichen Ausma&szlig; verrechnet. Bei Nichteinhaltung zweier Raten bei Teilzahlungen ist der Auftragnehmer berechtigt,
Terminverlust in Kraft treten zu lassen und &uuml;bergebene Akzepte f&auml;llig zu stellen.</p>
<h3>5.4.</h3>
<p>Der Auftraggeber ist nicht berechtigt, Zahlungen wegen nicht vollst&auml;ndiger
Gesamtlieferung, Garantie- oder Gew&auml;hrleistungsanspr&uuml;chen oder Bem&auml;ngelungen zur&uuml;ck zu halten.</p>
<h2>6. Urheberrecht und Nutzung</h2>
<h3>6.1.</h3>
<p>Alle Urheberrechte an den vereinbarten Leistungen (Programme, Dokumentationen
etc.) stehen dem Auftragnehmer bzw. dessen Lizenzgebern zu. Der Auftraggeber erh&auml;lt ausschlie&szlig;lich das Recht, die Software nach Bezahlung des vereinbarten 
Entgelts ausschlie&szlig;lich zu eigenen Zwecken, nur f&uuml;r die im Vertrag spezifizierte Hardware und im Ausma&szlig; der erworbenen Anzahl Lizenzen f&uuml;r die gleichzeitige Nutzung auf mehreren Arbeitspl&auml;tzen zu verwenden. Durch den gegenst&auml;ndlichen Vertrag wird lediglich eine Werknutzungsbewilligung erworben. Eine Verbreitung durch den Auftraggeber ist gem&auml;&szlig; Urheberrechtsgesetz ausgeschlossen. Durch die Mitwirkung des Auftraggebers bei der Herstellung der Software werden keine Rechte &uuml;ber die im gegenst&auml;ndlichen Vertrag festgelegte Nutzung erworben. Jede Verletzung der Urheberrechte des Auftragnehmers zieht 
Schadenersatzanspr&uuml;che nach sich, wobei in einem solchen Fall volle Genugtuung zu leisten ist.</p>
<h3>6.2.</h3>
<p>Die Anfertigung von Kopien f&uuml;r Archiv- und Datensicherungszwecke ist dem 
Auftraggeber unter der Bedingung gestattet, dass in der Software kein ausdr&uuml;ckliches Verbot des Lizenzgebers oder Dritter enthalten ist, und dass s&auml;mtliche Copyright- und Eigentumsvermerke in diese Kopien unver&auml;ndert mit &uuml;bertragen werden.</p>
<h3>6.3.</h3>
<p>Sollte f&uuml;r die Herstellung von Interoperabilit&auml;t der gegenst&auml;ndlichen Software die
Offenlegung der Schnittstellen erforderlich sein, ist dies vom Auftraggeber gegen Kostenverg&uuml;tung beim Auftragnehmer zu beauftragen. Kommt der Auftragnehmer dieser Forderung nicht nach und erfolgt eine Dekompilierung gem&auml;&szlig; Urheberrechtsgesetz, sind die Ergebnisse ausschlie&szlig;lich zur Herstellung der Interoperabilit&auml;t zu verwenden. Missbrauch hat Schadenersatz zur Folge.</p>
<h2>7. R&uuml;cktrittsrecht</h2>
<h3>7.1.</h3>
<p>F&uuml;r den Fall der &Uuml;berschreitung einer vereinbarten Lieferzeit aus alleinigem
Verschulden oder rechtswidrigem Handeln des Auftragnehmers ist der Auftraggeber berechtigt, mittels eingeschriebenen Briefes vom betreffenden Auftrag zur&uuml;ckzutreten, wenn auch innerhalb der angemessenen Nachfrist die vereinbarte Leistung in wesentlichen Teilen nicht erbracht wird und den Auftraggeber daran kein Verschulden trifft.</p>
<h3>7.2.</h3>
<p>H&ouml;here Gewalt, Arbeitskonflikte, Naturkatastrophen und Transportsperren sowie 
sonstige Umst&auml;nde, die au&szlig;erhalb der Einflussm&ouml;glichkeit des Auftragnehmers liegen, entbinden den Auftragnehmer von der Lieferverpflichtung bzw. gestatten
ihm eine Neufestsetzung der vereinbarten Lieferzeit.</p>
<h3>7.3.</h3>
<p>Stornierungen durch den Auftraggeber sind nur mit schriftlicher Zustimmung des 
Auftragnehmers m&ouml;glich. Ist der Auftragnehmer mit einem Storno einverstanden, so hat er das Recht, neben den erbrachten Leistungen und aufgelaufenen Kosten eine Stornogeb&uuml;hr in der H&ouml;he von 30% des noch nicht abgerechneten Auftragswertes des Gesamtprojektes zu verrechnen.</p>
<h2>8. Gew&auml;hrleistung, Wartung, &Auml;nderungen</h2>
<h3>8.1.</h3>
<p>M&auml;ngelr&uuml;gen sind nur g&uuml;ltig, wenn sie reproduzierbare M&auml;ngel betreffen und wenn 
sie innerhalb von 4 Wochen nach Lieferung der vereinbarten Leistung bzw. bei Individualsoftware nach Programmabnahme gem&auml;&szlig; Pkt. 2.4. schriftlich dokumentiert erfolgen. Im Falle der Gew&auml;hrleistung hat Verbesserung jedenfalls Vorrang vor Preisminderung oder Wandlung. Bei gerechtfertigter M&auml;ngelr&uuml;ge werden die M&auml;ngel in angemessener Frist behoben, wobei der Auftraggeber dem Auftragnehmer alle zur Untersuchung und M&auml;ngelbehebung erforderlichen Ma&szlig;nahmen erm&ouml;glicht.</p>
<p>Die Vermutung der Mangelhaftigkeit gem. § 924 ABGB gilt als ausgeschlssen. </p>
<h3>8.2.</h3>
<p>Korrekturen und Erg&auml;nzungen, die sich bis zur &Uuml;bergabe der vereinbarten Leistung 
aufgrund organisatorischer und programmtechnischer M&auml;ngel, welche vom Auftragnehmer zu vertreten sind, als notwendig erweisen, werden kostenlos vom Auftragnehmer durchgef&uuml;hrt.</p>
<h3>8.3.</h3>
<p>Kosten f&uuml;r Hilfestellung, Fehldiagnose sowie Fehler- und St&ouml;rungsbeseitigung, die 
vom Auftraggeber zu vertreten sind sowie sonstige Korrekturen, &Auml;nderungen und Erg&auml;nzungen werden vom Auftragnehmer gegen Berechnung durchgef&uuml;hrt. Dies gilt auch f&uuml;r die Behebung von M&auml;ngeln, wenn Programm&auml;nderungen, Erg&auml;nzungen oder 
sonstige Eingriffe vom Auftraggeber selbst oder von dritter Seite vorgenommen worden sind.</p>
<h3>8.4.</h3>
<p>Ferner &uuml;bernimmt der Auftragnehmer keine Gew&auml;hr f&uuml;r Fehler, St&ouml;rungen oder
Sch&auml;den, die auf unsachgem&auml;&szlig;e Bedienung, ge&auml;nderter Betriebssystemkomponenten, Schnittstellen und Parameter, Verwendung 
ungeeigneter Organisationsmittel und Datentr&auml;ger, soweit solche vorgeschrieben sind, anormale Betriebsbedingungen (insbesondere Abweichungen von den 
Installations- und Lagerbedingungen) sowie auf Transportsch&auml;den zur&uuml;ckzuf&uuml;hren sind.</p>
<h3>8.5.</h3>
<p>F&uuml;r Programme, die durch eigene Programmierer des Auftraggebers bzw. Dritte 
nachtr&auml;glich ver&auml;ndert werden, entf&auml;llt jegliche Gew&auml;hrleistung durch den Auftragnehmer.</p>
<h3>8.6.</h3>Soweit Gegenstand des Auftrages die &Auml;nderung oder Erg&auml;nzung bereits bestehender 
Programme ist, bezieht sich die Gew&auml;hrleistung auf die &Auml;nderung oder Erg&auml;nzung. Die Gew&auml;hrleistung f&uuml;r das urspr&uuml;ngliche Programm lebt dadurch nicht wieder auf.</p>
<h2>9. Haftung</h2>
<p>Der Auftragnehmer haftet f&uuml;r Sch&auml;den, sofern ihm Vorsatz oder grobe Fahrl&auml;ssigkeit nachgewiesen werden, im Rahmen der gesetzlichen Vorschriften. Die Haftung f&uuml;r leichte Fahrl&auml;ssigkeit ist ausgeschlossen. Der Ersatz von Folgesch&auml;den und Verm&ouml;genssch&auml;den, nicht erzielten Ersparnissen, Zinsenverlusten und von Sch&auml;den aus Anspr&uuml;chen Dritter gegen den Auftragnehmer ist in jedem Fall, soweit gesetzlich zul&auml;ssig, ausgeschlossen.</p>
<h2>10. Loyalit&auml;t</h2>
<p>Die Vertragspartner verpflichten sich zur gegenseitigen Loyalit&auml;t. Sie werden jede Abwerbung und Besch&auml;ftigung, auch &uuml;ber Dritte, von Mitarbeitern, die an der Realisierung der Auftr&auml;ge gearbeitet haben, des anderen Vertragspartners w&auml;hrend der Dauer des Vertrages und 12 Monate nach Beendigung des Vertrages unterlassen. Der dagegen versto&szlig;ende Vertragspartner ist verpflichtet, pauschalierten Schadenersatz in der H&ouml;he eines Jahresgehaltes des Mitarbeiters zu zahlen.</p>
<h2>11. Datenschutz, Geheimhaltung</h2>
<p>Der Auftragnehmer verpflichtet seine Mitarbeiter, die Bestimmungen gem&auml;&szlig; §15 des 
Datenschutzgesetzes einzuhalten.</p>
<h2>12. Sonstiges</h2>
<p>Sollten einzelne Bestimmungen dieses Vertrages unwirksam sein oder unwirksam werden, so wird hierdurch der &uuml;brige Inhalt dieses Vertrages nicht ber&uuml;hrt. Die Vertragspartner werden partnerschaftlich zusammenwirken, um eine Regelung zu finden, die den unwirksamen Bestimmungen m&ouml;glichst nahe kommt.</p>
<h2>13. Schlussbestimmungen</h2>
<p>Soweit nicht anders vereinbart, gelten die zwischen Vollkaufleuten zur Anwendung
kommenden gesetzlichen Bestimmungen ausschlie&szlig;lich nach &ouml;sterreichischem Recht, auch dann, wenn der Auftrag im Ausland durchgef&uuml;hrt wird. F&uuml;r eventuelle Streitigkeiten gilt ausschlie&szlig;lich die &ouml;rtliche Zust&auml;ndigkeit des sachlich zust&auml;ndigen Gerichtes f&uuml;r den Gesch&auml;ftssitz des Auftragnehmers als vereinbart. F&uuml;r den Verkauf an Verbraucher im Sinne des Konsumentenschutzgesetzes gelten die vorstehenden Bestimmungen nur insoweit, als das Konsumentenschutzgesetz nicht zwingend andere Bestimmungen vorsieht.</p> 
</BODY>
</HTML>

